package com.javaex.practice;

public class Ex15 {

	public static void main(String[] args) {
		
		//아래 프로그램의 결과를 코드작성전에 먼저 예상해보고 코드를 확인해보세요
		
		System.out.println(12 / 5 - 3);
		//예상 : (12 / 5) - 3
		// = 2 - 3
		//예상값 : -1, 결과값 : -1
				
		System.out.println(5 + 19 % 3);
		//예상 : 5 + (19 % 3)
		//= 5 + 1
		//예상값 : 6, 결과값 : 6
				
		System.out.println(2 + 2 / 2);
		//예상 : 2 + (2 / 2)
		//= 2 + 1
		//예상값 : 3, 결과값 : 3
				
		System.out.println(29 % 3 + 29 / 3);
		//예상 : (29 % 3) + (29 / 3)
		//= 2 + 9
		//예상값 : 11, 결과값 : 11
				
		System.out.println(29 % 3 + 18.0 / 4);
		//예상 : (29 % 3) + (18.0 / 4)
		//= 2 + 4.75	//계산미스...
		//예상값 : 6.75, 결과값 : 6.5
				
		System.out.println((14 + 7 / 2) / 4);
		//예상 : (14 + (7 / 2)) / 4
		//= (14 + 3) / 4
		//= 17 / 4
		//예상값 : 4, 결과값 : 4
				
		System.out.println((14 + 7 / 2.0) / 5);
		//예상 : (14 + (7 / 2.0)) / 5
		//= (14 + 3.5) / 5
		//= 17.5 / 5
		//예상값 : 3.5, 결과값 : 3.5 
				

	}

}
